package type;

public class Var {
	public static void main (String[] args) {
		//변수의 기본 타입(형_자료형, 숫자형)
		boolean A;	//**불리언 : true, false만 들어갈 수 있는 규격
		char B;		//캐릭터 : 문자 하나가 들어가는 규격
		byte C;		//바이트 : 아주 작은 수가 들어갈 수 있는 규격 (-128~127)
		short D;	//숏 : 2byte규격, 중간정도의 수가 들어갈 수 있는 규격 (약 3만)
		int E;		//**인티저(인트) : 일상적인 수가 들어갈 수 있는 규격 (약 21억)
		long F;		//롱 : 아주 긴 수가 들어갈 수 있는 규격
		float G;	//플로트 : 짧은 소수점이 들어갈 수 있는 규격 (소수점 아래 7자리)
		double H;	//**더블 : 긴 소수점이 들어갈 수 있는 규격 (float의 두배 15째 자리 까지...)
		
		//커스텀 변수 타입
		String I;	//스트링 : 문자열을 저장할 수 있는 규격 (2개이상)-파스칼표기법
		//******x5,000,0000
	}
}
